function [] = test_3(type)
hold on;


%手机
X1=[1,41,81,101,121,141,161,181,201,221,261,321,361,401,421];
Y1=[60,60,60,57,49,43,38,32,26,22,16,11,7,6,5];
X1OPT=[1,41,81,121,161,201,221,261,321,361,401,481,561,641,721,801,881,961,1041,1121,1201,1281,1361,1441,1481];
Y1OPT=[60,60,60,60,60,59,54,45,37,34,30,25,22,20,17,15,14,13,12,11,9,9,8,7,5];

%笔记本
X2=[150,180,190,220,250,280,310,340,370,400,430];
Y2=[60,60,53,34,25,18,13,11,9,8,0];
X2OPT=[80,180,240,300,360,420,480,540,600,660,720,780,840,900,960,1020,1080,1140,1200,1260,1320,1380,1440,1500,1560,1620,1680];
Y2OPT=[60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,59,55,55];


%台式
X3=[80,120,180,240,300,360,420,480,540,600,660];
Y3=[60,60,60,41,27,20,14,11,8,7,5];
X3OPT=[80,180,280,380,480,580,680,780,880,980,1080,1180,1280,1380,1480,1580,1680,1780,1880];
Y3OPT=[60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60,60];

if type==1,%手机
    plot(X1,Y1,'-g',X1OPT,Y1OPT,'-r');
    plot(X1,Y1,'.g',X1OPT,Y1OPT,'.r');
    %legend('台式机测试结果','笔记本测试结果','台式机测试结果','笔记本测试结果');   %右上角标注
    axis([80,1680,5,65]) ; %确定x轴与y轴框图大小
    %set(gca,'XTick',[0:1:6]) %x轴范围1-6，间隔1
    %set(gca,'YTick',[0:100:700]) %y轴范围0-700，间隔100
    ylabel('FPS')  %x轴坐标描述
    xlabel('人数') %y轴坐标描述
else if type==2,%笔记本
    plot(X2,Y2,'-g',X2OPT,Y2OPT,'-r');
    plot(X2,Y2,'.g',X2OPT,Y2OPT,'.r');
    %legend('台式机测试结果','笔记本测试结果','台式机测试结果','笔记本测试结果');   %右上角标注
    axis([80,1680,5,65]) ; %确定x轴与y轴框图大小
    %set(gca,'XTick',[0:1:6]) %x轴范围1-6，间隔1
    %set(gca,'YTick',[0:100:700]) %y轴范围0-700，间隔100
    ylabel('FPS')  %x轴坐标描述
    xlabel('人数') %y轴坐标描述
else %台式
    plot(X3,Y3,'-g',X3OPT,Y3OPT,'-r');
    plot(X3,Y3,'.g',X3OPT,Y3OPT,'.r');
    %legend('without lightweight treatment','with lightweight treatment');   %右上角标注
    axis([80,1680,5,65]) ; %确定x轴与y轴框图大小
    %set(gca,'XTick',[0:1:6]) %x轴范围1-6，间隔1
    %set(gca,'YTick',[0:100:700]) %y轴范围0-700，间隔100
    ylabel('FPS')  %x轴坐标描述
    xlabel('人数') %y轴坐标描述
end;

end